{
  "title": "The Top Ten Movies Every Entrepreneur Should Watch",
  "date": "5th Jun 2019",
  "author": "Harrison Davis",
  "thumbnail": "",
  "body": "By this point, you all know that I am a big believer in reading everything of value that you can get your hands on. Books are the means by which you can gain insights from some of the most brilliant and successful people on this planet without ever having to leave your house. With that said, sometimes you may just want to sit back, relax, and be inspired. I for one enjoy closing off most nights by watching a movie of TV show. Here is a list of the top 5 movies that have inspired me as an entrepreneur. \n\nAs always, let me know what you think about the list on Twitter by tagging @sevlution and including a link to this article. \n\nHope you enjoy,\n\nHarrison\n\n## **\\#1 The Pursuit of Happiness**\n\n![Movies every entrepreneur should watch: The Pursuit of Happiness ](/images/uploads/thepursuitofhapiness.jpg \"The Pursuit of Happiness\")\n\nLessons:\n\n* The importance of going all-in.\n* There are no excuses, anyone can become anything if they work hard enough at it.\n* Never forget why you are doing something\n\n## \\#2 Moneyball\n\n![Movies every entrepreneur should watch: Moneyball](/images/uploads/moneyball.jpg \"Moneyball\")\n\nLessons:\n\n* David can beat Goliath, he just has to play a different game\n* If you don't have the resources of your competition, you need to stop using their same strategy; abandon conventional thinking and do what works\n* Data and analytics are at the heart of good decision making\n* If you truly believe you are on the right course, ignore the naysayers and keep pushing forward\n\n## \\#3 The Founder\n\n![Movies every entrepreneur should watch: The Founder](/images/uploads/thefounder.jpg \"The Founder\")\n\nLessons:\n\n* Create amazing systems that scale.\n* Know what business you are truly in.\n* Think bigger.\n* Get everything in writing.\n\n## \\#4 FYRE: The Greatest Party That Never Happened.\n\n![Movies Every Entrepreneur should watch: FYRE: The Greatest Party That Never Happened.](/images/uploads/fyre.jpeg \"FYRE: The Greatest Party That Never Happened.\")\n\nLessons:\n\n* Never over-promise.\n* A great marketing campaign should come AFTER you have built a great product - not before.\n* Plan early and plan for disaster.\n\n## \\#5 Steve Jobs\n\n![Movies Every Entrepreneur should watch: Steve Jobs](/images/uploads/stevejobs.jpg \"Steve Jobs\")\n\nLessons:\n\n* Aim high and accept nothing less than excellence.\n* Build a personal brand that will allow you to jump from success to success.\n* Mobilize the press and media to back you up."
}